#+TITLE: Flycheck for org-babel
#+property: header-args :tangle yes

* Overview of the code

The goal of this library is to get flycheck overlays onto org-babel src-blocks /in org-mode/. The difficulty in this is that flycheck requires a file, but the src-blocks often have no corresponding file.

The solution here is to create a proxy file for the src-blocks that is used with flycheck. We get the overlays from that buffer, and then transfer them to the org-file.

We rely on some hook functions to create the proxy file after saving, and an idle timer to asynchronously move the overlays back.

For dog-fooding fun, this library is written in an org-file and tangled to get it.

You load the file like this:

#+BEGIN_SRC emacs-lisp :tangle no
(org-babel-load-file "scimax-ob-flycheck.org")
#+END_SRC

#+RESULTS:
: Loaded /Users/jkitchin/vc/jkitchin-github/scimax/scimax-ob-flycheck.el

And to use it,

#+BEGIN_SRC emacs-lisp :tangle no
(scimax-ob-flycheck-mode +1)
#+END_SRC

See [[id:4C28546C-8F3F-4AD4-900E-C623C8485183][Known Limitations]].

** Helper functions

 We need to create a set of proxy files for each language in the file. First, we create a function to get all the languages in the file.

 #+BEGIN_SRC emacs-lisp
(defun obf-get-src-languages ()
  "Return a list of the languages in this file."
  (let ((langs '()))
    (org-babel-map-src-blocks (buffer-file-name)
      (pushnew lang langs :test 'string=))
    langs))
 #+END_SRC

 #+RESULTS:
 : obf-get-src-languages

 Here is a test of that function. I don't want this block in the src file, so I set tangle to "no".

 #+BEGIN_SRC emacs-lisp :tangle no
(obf-get-src-languages)
 #+END_SRC

 #+RESULTS:
 | emacs-lisp |

 Next, for each language, we need to create a proxy file. The proxy file should contain just the code for that language, and it is important that the code be in the same place as in the org-file. That way, we can get the overlays in the proxy-file and just move them to the org-file. We will accomplish this by replacing all the non-code characters with spaces. We will use this function in an after-save-hook to update those files.

 For now we keep this simple and assume that all the code will be flychecked. We do not make separate proxies for blocks that should be tangled to other files, nor do we exclude code that should not be tangled.

 #+BEGIN_SRC emacs-lisp
(defvar obf-file-extensions
  '(("emacs-lisp" . ".el")
    ("python" . ".py")
    ("ipython" . ".py"))
  "An a-list of (language . extension).
When we create the proxy files we need an extension for each block.")

 #+END_SRC

 #+RESULTS:
 : obf-file-extensions

 We will generate a filename for each proxy file. This could cause some problems if flycheck uses filenames to check things like imports, etc. This is the place to fix that if it comes up.

 #+BEGIN_SRC emacs-lisp
(defun obf-proxy-filename (lang)
  "Generate the proxy filename for LANG."
  (s-concat (if-let (bf (buffer-file-name))
		(md5 (expand-file-name bf))
	      "scratch")
	    (cdr (assoc lang obf-file-extensions))))
 #+END_SRC

 #+RESULTS:
 : obf-proxy-filename

 #+BEGIN_SRC emacs-lisp :tangle no
(obf-proxy-filename "emacs-lisp")
 #+END_SRC

 #+RESULTS:
 : c5cf61bd19967646e8dd15c53e6c6435.el



